S2_todb/log2/out_fail_1546.txt
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time

Forcing shutdown in 15 seconds

Initializing worker threads...

Threads started!

FATAL: The --max-time limit has expired, forcing shutdown...
SQL statistics:
    queries performed:
        read:                            33374
        write:                           64686
        other:                           488
        total:                           98548
    transactions:                        81     (5.40 per sec.)
    queries:                             98548  (6569.81 per sec.)
    ignored errors:                      316    (21.07 per sec.)
    reconnects:                          0      (0.00 per sec.)

Number of unfinished transactions on forced shutdown: 50

Throughput:
    events/s (eps):                      5.4000
    time elapsed:                        15.0001s
    total number of events:              81

Latency (ms):
         min:                                  762.83
         avg:                                 6720.03
         max:                                14879.39
         95th percentile:                    13550.80
         sum:                               544322.28

Threads fairness:
    events (avg/stddev):           2.6200/0.94
    execution time (avg/stddev):   10.8864/12.08