S2_todb/log2/out_fail_2092.txt
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time

Forcing shutdown in 15 seconds

Initializing worker threads...

Threads started!

FATAL: The --max-time limit has expired, forcing shutdown...
SQL statistics:
    queries performed:
        read:                            103022
        write:                           6329
        other:                           172
        total:                           109523
    transactions:                        5      (0.33 per sec.)
    queries:                             109523 (7301.49 per sec.)
    ignored errors:                      115    (7.67 per sec.)
    reconnects:                          0      (0.00 per sec.)

Number of unfinished transactions on forced shutdown: 50

Throughput:
    events/s (eps):                      0.3333
    time elapsed:                        15.0001s
    total number of events:              5

Latency (ms):
         min:                                 5065.11
         avg:                                 9144.81
         max:                                13231.08
         95th percentile:                    13308.98
         sum:                                45724.07

Threads fairness:
    events (avg/stddev):           1.1000/0.36
    execution time (avg/stddev):   0.9145/15.00